app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def create
    @post = current_user.posts.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["title", "hello"], ["body", "sjksmckxc"], ["created_at", 2016-06-27 10:11:53 UTC], ["updated_at", 2016-06-27 10:11:53 UTC]]

  def update
    @post = current_user.posts.find(params[:id])
    respond_to do |format|
      if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Updated Title"], ["body", "Updated Body"], ["updated_at", 2016-06-27 12:35:14 UTC], ["id", 4]]

  def destroy
    # @post = user_posts_url.find(params[:id])
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]

    def set_post
    user = User.find(params[:user_id])
      @post = Post.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]